李建伟民法体系2022
专题一 民事法律行为及其外延
之一，意思表示（民事法律行为的实现方式）

民事法律行为是民事主体通过意思表示设立、变更、终止民事法律关系的行为。
eg：要约（教授卖书的广告牌），承诺，保函是一个邀约offer
生效、撤销、撤回、瑕疵、解释
之二，效力体系（民事法律行为的评价规则）
民事法律行为的效力体系



生命周期
成立
效力
附条件
附期限
需审批
生效
失效



开始效力
最终效力




法律意义
事实判断
价值判断
等待生效或不生效中
约束力
权利义务终止

类型
成立
有效
有效

生效




无效






不成立
效力待定
无效

不生效




（无可撤销）







成立，并生效
成立暨生效
成立
有效
有效
不附条件
生效（如登记结婚）



先成立，后生效
成立
有效
有效
附条件的，条件成就
生效（如遗嘱）







附期限的，期限到来








需审批的，已被审批



成立，不生效
行为（最终）无效
成立
无效
自始无效

不生效




成立
可撤销（有效）
被撤销，自始无效

不生效






不背撤销，自始有效

生效




成立
效力待定
不被追认/被善意相对人撤销，自始无效

不生效






被追认，自始有效

生效



行为不能生效
成立
有效
有效
需批准的，未获批准的
不生效




成立
有效
有效
附条件的，条件未成就的
不生效




成立
有效
有效
附期限的，期限未到来的
不生效



成立、有效（瑕疵：可撤销、效力待定、无效）、批准条件期限、生效（不生效）；
注意，成立了，有效了，生效了，履行期限到来了
之三，代理（民事法律行为之延伸）

其一，代理和委托之关系
联系：
代理是一种特殊的委托（但并不是所有代理都需要委托）。在委托合同中我们称委托人与受托人，但是如果委托构成代理（即委托代理），我们就称委托人为被代理人，受托人为代理人。

委托如何构成代理：委托的事务是非具有人身性质的双方法律行为，委托即构成代理
①代理行为是法律行为
②三方当事人缺一不可，自己代理除外（区别于委托合同）
③主观上为被代理人利益服务（区别于无权处分）
④原则上代理人以被代理人名义实施代理行为，间接代理除外
原则上受托人以委托人的名义实施委托行为，间接代理除外
总结：以谁的名义从事活动，委托和代理保持一致的规则

区别
①无委托依旧有代理（如法定代理），有委托未必有代理（如委托的事务不是非人身性质的双方法律行为）
②委托合同 + 代理授权书 ＝ 代理权
前者是双方行为，后者是单方行为，代理权的依据不是委托合同而是代理授权书。

其二，狭义的无权代理和表见代理

无论是狭义的无权代理还是表见代理，第三人都相信代理人有代理权外观

其三，直接代理和间接代理
核心：直接和间接代理不看代理人以谁的名义，而是看第三人知不知道代理人背后的本人（被代理人）
直接代理
明示的直接代理
代理人以被代理人名义代理
默示的直接代理
注意：此种代理名称存在争议：李建伟称之为默示的直接代理；孟献贵称之为显名的间接代理
代理人以自己名义代理，但第三人知晓代理人与被代理人的代理关系
约束的对象是被代理人和第三人

间接代理（隐名的间接代理）
代理人以自己的名义代理，第三人不知晓代理人与被代理人的代理关系
原则：代理效果约束代理人与第三人
例外
第三人违约的，代理人向丙披露被代理人后，被代理人有介入权：
被代理人可行使代理人对第三人的权利

被代理人违约的，代理人向丙披露被代理人后，第三人有选择权：
选择被代理人：向被代理人主张权利
选择代理人：向代理人主张权利
专题二 公示公信原则与善意取得
公示原则：

物权是对世权，不能藏着掩着，必须公开

动产以占有或者转移占有（交付）为权利享有和变动的公示方法

不动产以登记或者变更登记为权利享有和变动的公示方式


公信原则：
有什么好处，公示随即产生公信，

“你有公示我就可以推定你享有权利，我信赖公示我就受到保护，保护的方式是别人不能对抗我”

其一，权利推定效力：记载于不动产登记簿的人推定为该不动产的权利人，动产的占有人推定为该动产的权利人，除非有相反的证据证明，这被称为“权利的正确性推定效力”或者“权利外观的证明力”。

这表明真实权利人和推定的权利人可以不是同一人，所以，公示只能是推定效力，不是权利判断的最终依据


其二，权利保护效力：若权利人在享有、变动物权时依法律要求进行了公示，相对人因信赖这一公示而为一定行为，事后即使公示出来的物权状态与真实物权状态不符，相对人也受法律保护的方式就是承认发生物权变动的效力。


正式由于真实权利人和推定权利人可以不为一人，所以法律需要保护不知情的第三人，保护交易安全，关注公示状态即可，不必在乎真实权利归属，是法律在保护交易安全和牺牲真实权利人利益之间做出的取舍

其三，权利对抗效力（物权才有，债权没有）：如权利人在享有、变动物权时依法进行了公示，则物权变动的效果足以对抗第三人（无所谓善恶）；反之，如权利人未依法公示，则其物权不得对抗善意第三人（但可以对抗恶意第三人）。



对抗：即主张权利，不得对抗善意第三人指的是不能对善意第三人主张权利
善意：即不知情（不知道真实权利归属）且无重大过失

权利对抗效力的背后法理：
由于物权的对世性，需要让全世界知晓，所以让别人知晓权利归属是物权公示的核心，也就是说即使不公示，但别人也知道真实权利归属也可以发生对抗（恶意第三人知情权利归属，满足权利对抗效力的核心，所以即便是不公示也可以对抗恶意第三人）

关联问题：权利对抗效力 ≠ 权利取得效力
能不能对抗 ≠ 第三人能不能取得权利

能不能对抗归对抗效力来调整，第三人能不能取得权利归具体权利的取得规则来调整
通过以下两个例子来说明：

情况一，能对抗，第三人也能取得权利
例1：动产抵押中，抵押人登记了也不能对抗正常经营活动中的买受人。抵押权登记了确实可以对抗任何第三人，但是第三人取得权利是基于法律规定，即便是第三人恶意也不能对抗

情况二，不能对抗，第三人也没有取得权利
例2：对于无权处分人的物权处分行为，未公示的甲 “对抗了” （没有交付登记/有偿的）善意第三人。丙未登记确实不得对抗善意第三人，但是第三人没有取得权利不是因为甲的对抗，而是不满足第三人取得权利的具体规则（善意取得5要件）

除外，上面两个例子也体现了民法对善意第三人的保护措施不止善意取得，只是其中之一

之二，善意取得的构成
善意取得具有强化占有公信力，保护交易安全，适用于自物权他物权（抵押权，质权，留置权，各种用益物权）

下面以一个典型的例子来看各方当事人的善意取得构成要件

对甲（无权处分人）的要求：
有权占有：动产要委托占有，不动产要委托登记，且不可为脱离物（绝对不适用善意取得）
无权处分：一方面，甲必须实施了处分行为（不可为负担行为）；另一方面，该处分行为是无权处分（没有处分权或者处分权不足）
对丙（第三人）的要求：
善意：不知情（不知道真实权利归属）且无重大过失（尽到合理注意义务），善意要一直保持到公示完成之时。
有偿：合理价格受让。
完成公示：完成权利变动对应的公示方式（交付方式不可为占有改定）

脱离物绝对不是用善意取得：遗失物、漂流完，盗赃物

追回规则：

关联问题：
无权处分区别于有权处分；无权处分区别于无权代理

其一，无权处分与无权代理
善意恶意不影响无权处分行为的合同行为的有效，仅影响物权权利变动

无权处分
无权代理（狭义）

以谁定名义处分？
甲
乙

当事人是谁？
甲丙
乙丙

合同效力如何？
有效
效力待定

为了谁定利益？
甲
乙

对什么外观的相信？
对公示外观的相信
对代理权的相信

是否构成善意取得？
满足条件后可构成善意取得
绝对不构成善意取得



其二，善意取得过程中债权与物权效力（债权有效，物权待定）

①无权处分的合同，确定有效
即便是“空买空卖”合同，在履行期限届至时任然有被履行的可能。
构成善意取得，必须以无权处分合同有效为前提（反之，如果因为其他无效、可撤销理由而宣告无效、被撤销，受让人不得主张善意取得）

②无权处分的物权，效力待定
能不能取得物权主要取决于以下两条途径能不能走的通：其一，受让人满足善意取得全部要件，主张善意所有权；其二，真实权利人事后追认，继受取得所有权
专题四 占有与请求权救济体系
之一，请求权基础

其一，物权请求权的返还原物
物权请求权包含返还原物、停止侵害、排除妨害、消除危险，本处只讲返还原物
① 权利主体是物权人
② 义务人是无权占有人
无权占有人：无所谓善恶，含直接占有和间接占有
③ 以基础权利受到侵害为前提
④ 以原物尚存为前提，否则只能转化为损害赔偿请求权（债权请求权）
何谓原物尚存（是否能控制物）：毁损灭失、被偷盗都不是原物尚存；出租、保管都是原物尚存
⑤ 普通动产适用诉讼时效期间，但登记动产与不动产不适用诉讼时效期间。
其二，占有保护请求权的返还原物
占有保护请求权与物权请求权高度类似，包含返还原物、停止侵害、排除妨害、消除危险，本处只讲返还原物
① 权利主体是占有人
② 义务人是侵占人
③ 以基础利益（占有不是权利）受到侵害为前提
④ 以原物尚存为前提，否则只能转化为损害赔偿请求权（债权请求权）
⑤ 适用一年除斥期间，自侵占发生之日起算

物权请求权还是占有保护请求权的停止侵害、排除妨害、消除危险都不受诉讼时效限制

之二，占有
占有不是一种权利而是一种利益，是一个准物权

占有类型
区分标准
区分意义

自主占有和他主占有
占有人是否把自己当做所有权人
直接占有人都是是他主占有

直接占有和间接占有
占有人是否直接占有物
间接占有也是处于控制之下，不能以此作为区分标准

有权占有和无权占有

占有人是否有占有本权（是客观上有没有本权而不是自认为有没有本权）
原物返还：对象是无权占有人
留置权：自己是有权占有
善意取得：对方是有权占有


善意占有和恶意占有
占有人自己是否知道自己是不是无权占有
损害侵权风险、孳息和原物、物上代位金


损害侵权风险、孳息和原物、物上代位金
这主要涉及民法典450、460、461三个条文

①损害（损耗责任）、侵权责任、风险责任
损耗责任（损害）：恶赔善不赔
侵权责任：侵权责任都赔（不区分善恶）
风险责任：恶意承担风险，善意不承担风险

②原物和孳息
原物和孳息返还不区分善恶，但占有人维护该物的必要费用恶给善不给

③物上代位金
物上代为金返还不区分善恶，没有补偿完的恶赔善不赔

之三，请求权救济体系
通过两个例子说明物权请求权、占有保护请求权、债权请求权组成的请求权救济体系
例 1：

例1
1.甲对乙、丙享有基于所有权的返还原物请求权
2.甲对乙、丙享有基于占有利益的返还原物请求权
3.乙对丙享有基于占有媒介关系消灭的返还原物请求权
4.就乙对丙享有的返还原物请求权，甲可以请求乙转让给自己
5.如丙损害了占有物，甲对丙，基于所有权、占有利益的损害而享有侵权损害赔偿
请求权
6.如丙损害了占有物，乙对丙，基于占有利益的损害而享有侵权损害赔偿请求权
7.就乙对丙享有的侵权损害赔偿请求权，甲也可以请求乙转让给自己

例2：

1.甲对丙，享有基于所有权的返还原物请求权，但甲对丙不享有占有人的返还原物请求权
2.甲对乙，享有基于所有权、占有利益被侵害后的侵权赔偿请求权
3.乙对丙，享有占有人的返还原物请求权
4.就乙对丙享有的占有人的返还原物请求权，甲可以请求乙转让给自己
5.如丙损害了占有物，甲对丙基于所有权损害而享有侵权损害赔偿请求权
6.如丙损害了占有物，乙对丙基于占有利益的损害而享有侵权损害赔偿请求权
7.就乙对丙享有的侵权损害赔偿请求权，甲也可以请求乙转让给自己


保管：已偷走甲的东西给丙保管，乙和丙构成一个完整的占有，共同侵害甲的占有和所有
间接占有人没有失去对物的控制权，（可以要求直接占有人返还）-偷的东西叫保管，所以仍然是占有人，所以间接占有人仍然是原物尚存（有控制或者没有灭失）

强盗：如果直接占有人丙以自主占有的意思占有（偷得东西被抢走），则直接占有人丙变成占有人（直接占有人），“间接占有人乙”不是原物尚存（有控制或者没有灭失），甲不向乙主张返还原物（乙履行不能，所有权人只能基于占有或所有请求赔偿）
被偷走构成履行不能，不能返还原物，转化为其他损害赔偿等其他违约责任
专题三 物权变动模式和物债两分
物权变动指的是物权的设立变更移转消灭（）
物权变动的两种方式，原始取得和寄售取得，寄售取得只有合同和继承，其余全是原始取得（原本就没有主人的三种典型孳息，劳动，先占天生无主物和抛弃物，原本有主人，不依赖愿所有人的意思，一种是功法方式，另一种是司法方式善意取得）
物权变动的原因，基于法律行为和非基于法律行为


之一，基于民事法律行为的物权变动模式：

其一，公式成立（有效合同+登记/交付）：大部分物权变动适用此规则，除以下两类
公示后才取得物权，直接对抗第三人

其二，公示对抗（有效合同＝物权变动+登记＞第三人）
公示不影响物权取得，但不登记不得对抗善意第三人
① 地役权
② 动产抵押（含动产浮动抵押）
③ 土地承包经营权的互换、转让
④ 土地经营权流转（五年以上）

其三，特殊变动（公示成立和公示对抗外地特殊规则）
特殊动产专指的是汽车、传播、航空器（机器设备不算）
① 土地承包经营权设立：有效合同＝物权变动+对抗第三人
② 特殊动产：有效合同+交付＝物权变动+登记＞第三人

四种情况搞定三步走：
交付但未登记的，不得对抗善意第三人（无权处分，第三人善意取得）
交付且登记的，可以对抗第三人（无权处分，第三人不能善意取得）
登记对抗善意第三人的效力，需要以交付为前提，因为这是物权的对抗效力而非债权的对抗效力（有权处分，一车二卖（无所谓第三人善恶意），第三人继受取得）
买受人已经支付对价并交付的，即可对抗转让人的普通债权人（到期债权）


之二，物债两分


① 登记、交付不完成，不影响债权行为（合同）的效力
合同生效，如一方不履行，将承担违约责任

② 登记、交付不完成不发生物权变动

物债两分原则四大具体应用：
无权处分合同是有效的，但只有相对人善意的（再加上有偿且完成交付或者登记等要件)，才产生物权效力（善意取得）
2.预告登记后，所有权人再处分不动产的，合同有效(债权），未经预告登记人同意，不产生物权效力
3.一物多卖的合同有效，但唯有完成动产交付或不动产登记的，才取得物权
4.非基于法律行为而导致物权变动的（如基于合法建造、继承、征收决定。形成之诉的生效裁决），自事实成就时取得物权（登记既非生效也非对抗要件），但再处分该不动产的如买卖、抵押等，不经登记，处分合同有效，但不发生物权效力
专题五 共有
所有权分为单独所有和共同所有（共有），共有归根结底是所有权制度的关联制度

其一，如何看按份还是共同？
①有约从约
②无约定或者约定不明的，原则上推定为按份共有，但是有三类共有关系（夫妻财产共有、家庭财产共有、遗产分割前的共有）的推定为共同共有

其二，如果是按份共有，份额怎么样确定？
①有约从约
②无约定或者约定不明的，按照出资额确定
③不能确定出资额的，推定等额

其三，按份共有和共同共有的内部、外部关系？
内部关系：
无论是按份共有还是共同共有，都是针对于共有人内部关系来说的：

按份共有
共同共有

收益
按份享有
不分份额享有

管理（小修小补，区分于下）
人人皆可为之，有权利也有义务

重大修缮
2/3以上份额（注意不是人）
全体共有人一致同意

改变性质和用途



处分（非负担）共有物



分割共有物（会导致共有关系终结）
共有人约定不得分割共有的不动产或者动产，以维持共
有关系的，应当按照约定，但是共有人有重大理由需要分割的，可以请求分割


没有约定或者约定不明确的，按份共有人可以随时请求分割
没有约定或者约定不明确的，共同共有人在共有的基础丧失或者有重大理由（①毁灭财产②另一方不给钱看病）需要分割时可以请求分割


因分割造成其他共有人损害的，应当给予赔偿

转让共有份额（不会导致共有关系终结）
按份共有人有优先权（后续扩展）
没有份额，不存在转让


外部关系：
无论是按份共有还是共同共有都是对外承担连带责任
某一按份共有人承担完责任之后可以向其他按份共有人追偿；共同共有人没有办法追偿

其四，按份共有人的优先购买权相关问题？

优先购买权只适用于转让（继承、遗赠等不适用），且为同等条件下在合理期限内行使

不得主张优先购买权的情形？
①按份共有人之间内部转让份额的
②按份共有人在合理期限（有月从约，无约定就是15日）内主张的
③主张优先购买权时提出实质性变更要求的
④以侵害优先购买权为由，仅主张撤销或者认定共有份额转让无效的

担保及担保物权原理
之
